## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 7 to add, 0 to change, 7 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                           NAME                                            |
|--------|-------------------------------------------------------------------------------------------|
| add    | `aws_acm_certificate.forms_api[0]`                                                        |
|        | `aws_acm_certificate_validation.forms_api[0]`                                             |
|        | `aws_alb_listener_rule.forms_api[0]`                                                      |
|        | `aws_lb_listener_certificate.forms_api_https[0]`                                          |
|        | `aws_lb_target_group.forms_api[0]`                                                        |
|        | `aws_route53_record.forms_api[0]`                                                         |
|        | `aws_route53_record.forms_api_certificate_validation[&quot;api.forms-staging.cdssandbox.xyz&quot;]` |
| delete | `aws_acm_certificate.form_api[0]`                                                         |
|        | `aws_acm_certificate_validation.form_api[0]`                                              |
|        | `aws_alb_listener_rule.form_api[0]`                                                       |
|        | `aws_lb_listener_certificate.form_api_https[0]`                                           |
|        | `aws_lb_target_group.form_api[0]`                                                         |
|        | `aws_route53_record.form_api[0]`                                                          |
|        | `aws_route53_record.form_api_certificate_validation[&quot;api.forms-staging.cdssandbox.xyz&quot;]`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_acm_certificate.form_api[0] will be destroyed
  # (because aws_acm_certificate.form_api is not in configuration)
  - resource "aws_acm_certificate" "form_api" {
      - arn                       = "arn:aws:acm:ca-central-1:687401027353:certificate/2b15a286-e800-40e2-a31b-a3071a076011" -> null
      - domain_name               = "api.forms-staging.cdssandbox.xyz" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "api.forms-staging.cdssandbox.xyz"
              - resource_record_name  = "_4940559fb95fcaa7ffed8a2bd0dc0c8c.api.forms-staging.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_936569a7de63e7baf62c2107740deba6.sdgjtdhdhz.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:ca-central-1:687401027353:certificate/2b15a286-e800-40e2-a31b-a3071a076011" -> null
      - key_algorithm             = "RSA_2048" -> null
      - not_after                 = "2025-08-23T23:59:59Z" -> null
      - not_before                = "2024-07-25T00:00:00Z" -> null
      - pending_renewal           = false -> null
      - renewal_eligibility       = "ELIGIBLE" -> null
      - renewal_summary           = [] -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [
          - "api.forms-staging.cdssandbox.xyz",
        ] -> null
      - tags                      = {} -> null
      - tags_all                  = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - type                      = "AMAZON_ISSUED" -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null
        # (2 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate.forms_api[0] will be created
  + resource "aws_acm_certificate" "forms_api" {
      + arn                       = (known after apply)
      + domain_name               = "api.forms-staging.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "api.forms-staging.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "api.forms-staging.cdssandbox.xyz",
        ]
      + tags_all                  = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_acm_certificate_validation.form_api[0] will be destroyed
  # (because aws_acm_certificate_validation.form_api is not in configuration)
  - resource "aws_acm_certificate_validation" "form_api" {
      - certificate_arn         = "arn:aws:acm:ca-central-1:687401027353:certificate/2b15a286-e800-40e2-a31b-a3071a076011" -> null
      - id                      = "2024-07-25 12:28:44.685 +0000 UTC" -> null
      - validation_record_fqdns = [
          - "_4940559fb95fcaa7ffed8a2bd0dc0c8c.api.forms-staging.cdssandbox.xyz",
        ] -> null
    }

  # aws_acm_certificate_validation.forms_api[0] will be created
  + resource "aws_acm_certificate_validation" "forms_api" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_alb_listener_rule.form_api[0] will be destroyed
  # (because aws_alb_listener_rule.form_api is not in configuration)
  - resource "aws_alb_listener_rule" "form_api" {
      - arn          = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:listener-rule/app/form-viewer/5e6bc2d9ab810b68/028e8eeeed9c3a34/da5e1d035d4991ce" -> null
      - id           = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:listener-rule/app/form-viewer/5e6bc2d9ab810b68/028e8eeeed9c3a34/da5e1d035d4991ce" -> null
      - listener_arn = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:listener/app/form-viewer/5e6bc2d9ab810b68/028e8eeeed9c3a34" -> null
      - priority     = 100 -> null
      - tags         = {} -> null
      - tags_all     = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null

      - action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:targetgroup/form-api/bb1e4c676d21e4a0" -> null
          - type             = "forward" -> null
        }

      - condition {
          - host_header {
              - values = [
                  - "api.forms-staging.cdssandbox.xyz",
                ] -> null
            }
        }
    }

  # aws_alb_listener_rule.forms_api[0] will be created
  + resource "aws_alb_listener_rule" "forms_api" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:listener/app/form-viewer/5e6bc2d9ab810b68/028e8eeeed9c3a34"
      + priority     = 100
      + tags_all     = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "api.forms-staging.cdssandbox.xyz",
                ]
            }
        }
    }

  # aws_lb_listener_certificate.form_api_https[0] will be destroyed
  # (because aws_lb_listener_certificate.form_api_https is not in configuration)
  - resource "aws_lb_listener_certificate" "form_api_https" {
      - certificate_arn = "arn:aws:acm:ca-central-1:687401027353:certificate/2b15a286-e800-40e2-a31b-a3071a076011" -> null
      - id              = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:listener/app/form-viewer/5e6bc2d9ab810b68/028e8eeeed9c3a34_arn:aws:acm:ca-central-1:687401027353:certificate/2b15a286-e800-40e2-a31b-a3071a076011" -> null
      - listener_arn    = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:listener/app/form-viewer/5e6bc2d9ab810b68/028e8eeeed9c3a34" -> null
    }

  # aws_lb_listener_certificate.forms_api_https[0] will be created
  + resource "aws_lb_listener_certificate" "forms_api_https" {
      + certificate_arn = (known after apply)
      + id              = (known after apply)
      + listener_arn    = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:listener/app/form-viewer/5e6bc2d9ab810b68/028e8eeeed9c3a34"
    }

  # aws_lb_target_group.form_api[0] will be destroyed
  # (because aws_lb_target_group.form_api is not in configuration)
  - resource "aws_lb_target_group" "form_api" {
      - arn                                = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:targetgroup/form-api/bb1e4c676d21e4a0" -> null
      - arn_suffix                         = "targetgroup/form-api/bb1e4c676d21e4a0" -> null
      - deregistration_delay               = "30" -> null
      - id                                 = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:targetgroup/form-api/bb1e4c676d21e4a0" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:ca-central-1:687401027353:loadbalancer/app/form-viewer/5e6bc2d9ab810b68",
        ] -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_anomaly_mitigation  = "off" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "form-api" -> null
      - port                               = 3001 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {
          - "Name" = "form_api"
        } -> null
      - tags_all                           = {
          - "CostCentre" = "forms-platform-staging"
          - "Name"       = "form_api"
          - "Terraform"  = "true"
        } -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-0ad5b3739860129d0" -> null
        # (1 unchanged attribute hidden)

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 2 -> null
          - interval            = 10 -> null
          - matcher             = "200" -> null
          - path                = "/status" -> null
          - port                = "3001" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      - target_failover {}

      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      - target_health_state {}
    }

  # aws_lb_target_group.forms_api[0] will be created
  + resource "aws_lb_target_group" "forms_api" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "forms-api"
      + name_prefix                        = (known after apply)
      + port                               = 3001
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "forms_api"
        }
      + tags_all                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "forms_api"
          + "Terraform"  = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0ad5b3739860129d0"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 10
          + matcher             = "200"
          + path                = "/status"
          + port                = "3001"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # aws_route53_record.form_api[0] will be destroyed
  # (because aws_route53_record.form_api is not in configuration)
  - resource "aws_route53_record" "form_api" {
      - fqdn                             = "api.forms-staging.cdssandbox.xyz" -> null
      - id                               = "Z05990652HOQ0SGHD81ZC_api.forms-staging.cdssandbox.xyz_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "api.forms-staging.cdssandbox.xyz" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z05990652HOQ0SGHD81ZC" -> null
        # (2 unchanged attributes hidden)

      - alias {
          - evaluate_target_health = true -> null
          - name                   = "form-viewer-1810755345.ca-central-1.elb.amazonaws.com" -> null
          - zone_id                = "ZQSVJUPU6J1EY" -> null
        }
    }

  # aws_route53_record.form_api_certificate_validation["api.forms-staging.cdssandbox.xyz"] will be destroyed
  # (because aws_route53_record.form_api_certificate_validation is not in configuration)
  - resource "aws_route53_record" "form_api_certificate_validation" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_4940559fb95fcaa7ffed8a2bd0dc0c8c.api.forms-staging.cdssandbox.xyz" -> null
      - id                               = "Z05990652HOQ0SGHD81ZC__4940559fb95fcaa7ffed8a2bd0dc0c8c.api.forms-staging.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_4940559fb95fcaa7ffed8a2bd0dc0c8c.api.forms-staging.cdssandbox.xyz" -> null
      - records                          = [
          - "_936569a7de63e7baf62c2107740deba6.sdgjtdhdhz.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z05990652HOQ0SGHD81ZC" -> null
        # (2 unchanged attributes hidden)
    }

  # aws_route53_record.forms_api[0] will be created
  + resource "aws_route53_record" "forms_api" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.forms-staging.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "Z05990652HOQ0SGHD81ZC"

      + alias {
          + evaluate_target_health = true
          + name                   = "form-viewer-1810755345.ca-central-1.elb.amazonaws.com"
          + zone_id                = "ZQSVJUPU6J1EY"
        }
    }

  # aws_route53_record.forms_api_certificate_validation["api.forms-staging.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "forms_api_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z05990652HOQ0SGHD81ZC"
    }

Plan: 7 to add, 0 to change, 7 to destroy.

Changes to Outputs:
  ~ lb_target_group_api_arn        = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:targetgroup/form-api/bb1e4c676d21e4a0" -> (known after apply)
  ~ lb_target_group_api_arn_suffix = "targetgroup/form-api/bb1e4c676d21e4a0" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.form_viewer"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.form_viewer_maintenance_mode"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.forms_api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.forms_api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudfront_distribution.maintenance_mode"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.firehose_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.firehose_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.form_viewer"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.form_viewer_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.form_viewer_https"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.form_viewer_1"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.form_viewer_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.forms_api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.maintenance_mode"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_css_files[\"style.css\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_html_files[\"index-fr.html\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_html_files[\"index.html\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_ico_files[\"favicon.ico\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_svg_files[\"site-unavailable.svg\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.alb"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.route53_hosted_zone[0]"]
WARN - plan.json - main -...
```

</details>
